# ERD Normalization

## ERD(Entity Relationship Diagram)

Entity와 Relation의 관계를 나타내어 데이터 베이스 구조를 한눈에 파악할 수 있게 하는 다이어그램

### 용도

실제 데이터 베이스를 구현하여, 개발, 데이터 관리에 이용한다.

데이터베이스 구조를 한눈에 이해할 수 있다.

SQL쿼리의 성능을 최적화 하기 위해 데이터 베이스 설계의 필수 작업이다.

### 개념적 모델링

구현 하고자 하는 데이터들 간의 관계를 구상한다.

개체들의 관계를 파악하고 Entity들을 도출하는 단계이다.

ERD를 작성하는 단계이다.

### 논리적 모델링

업무 중심 데이터 모델을 만들어 내는 단계

상세 속성들을 정의한다. (데이터 타입, key 지정, 정규화 진)

### 물리적 모델링

최종적으로 데이터 베이스를 선택하고 테이블을 만드는 작업

## 정규화 과정

잘못된 종속 관계를 해결하고,

저장 공간을 효율적으로 사용하기 위해 테이블을 분리하는 과정

제1, 2, 3, 보이스/코드 정규형이 있다.

정규화가 진행될수록 데이터 중복성이 감소하지만 그만큼 조회할 때 조인을 많이 진행해야할 수 있다.

많은 join으로 인한 sql 성능 저하를 방지하기 위해 반정규화를 진행하기도 한다.

### 제 1 정규형

테이블 간 중복된 데이터를 없애는 과정

저장공간을 아끼고, 무결성을 유지할 수 있다.

컬럼이 분해되지 않는 하나의 값을 가지도록 분해한다.

### 제 2 정규형

제 1 정규형을 만족하면서, **부분 함수 종속성을 제거한 형태이다.**

기본키가 아닌 속성이 기본키에 완전히 종속되어야 한다. == 기본키의 부분집합이 결정자가 되어선 안된다.

![image](https://github.com/cJinu/CS/assets/104177326/47051451-c681-4e2e-8559-708f6fa4770f)

![image](https://github.com/cJinu/CS/assets/104177326/8f38d822-5e7f-4cf8-9f35-a2c62733c4a7)

### 제 3 정규형

제 2 정규형을 만족하면서, **이행적 함수 종속을 없애는 단계이다.**

A,B,C라는 컬럼이 A→B, B→C의 종속관계를 가져 A→C가 되는 것을 의미한다.

![image](https://github.com/cJinu/CS/assets/104177326/c57f4ac0-1cc1-4bfb-aaf6-f0ccffb8d302)

![image](https://github.com/cJinu/CS/assets/104177326/eca40e6b-7141-40ff-9e3e-dc9bd8618162)

### 보이스/코드 정규형 (BCNF)

제 3정규형을 만족하면서 **모든 결정자가 후보키가 되도록 테이블을 분해하는 것**

![image](https://github.com/cJinu/CS/assets/104177326/d89dde4a-45e2-4846-b4ae-50e11c82ae11)

교수는 특강 이름을 결정하는 결정자지만 후보키가 아니다. 이러한 테이블을 분해하여 만족할 수 있다.
